"EVERY intelligent member of the medical profession will certainly recognise the special value of human conscience in the profession.\n\nThe problems which are involved in the practice of the beneficent art, the absolute reliance which the anxious patient is compelled to place in his physician, the helplessness of the poor, who form so large a majority of those who need medical aid, and who are without the defences of wealth and station, show the need of keen moral sense, as well as intelligence, in those who practise the art of medicine.\n\nThe very discoveries of medical science enforce this necessity; for the possibility of abuse in the employment of such beneficent agents as anæsthetics and hypnotism, by incompetent or conscienceless operators, is a very serious fact.\n\nThe suicides that have taken place after so-called 'successful' operations (as, for example, the production of artificial anus), the pathetic exclamation of poor Montagu Williams, that his brilliant operation had ruined his constitution, and the reckless castrations proved by Dr. Chanu in France, are facts, to be seriously weighed by medical conscience, showing the necessity of restraining too eager experiment.\n\nThis special responsibility of the medical profession to society is greatly increased by the fact that the training of a very large section of our intelligent youth during the important years of early manhood rests upon them. The moral as well as intellectual influence exerted by those who guide the college, the hospital, the dispensary, and post-graduate classes, will mould the future action of one of the most influential portions of the community, those, viz., on whom the health of the nation chiefly rests.\n\nNow, whilst all recognise the need of the trained and skilful care of a nation's health, and perceive also that rightly organized medical schools and hospitals are of great value in educating our health guardians, how is it that a profound distrust of these institutions has grown up in our midst; that the support of hospitals becomes increasingly difficult, whilst at the same time the sentiment of benevolence and desire to help the poor is constantly extended?\n\nHow is it that the beneficent and necessary art of medicine no longer commands that respect and confidence which its essential character as part of our social institutions would seem to demand?\n\nThe answer to these serious questions involves both moral and intellectual considerations. These problems have arisen from failure to perceive that in education moral and intellectual activity cannot be advantageously divorced, or that one portion of our complex nature can be beneficially developed whilst other portions are entirely ignored or injured.\n\nOur medical schools, whilst sharpening the intellectual faculties of their students, are not careful that their modes of teaching bring with them no deterioration of that important faculty of their students, the moral sense. As conscience or the moral sense is unequally developed in human beings, but is indispensable to the physician in his relations with patients, any apathy or negligence in this respect by the trainers of youth may become a national danger. MORALITY, as a guide in biological science, is based upon the practical distinction between organic and inorganic Nature.\n\nIf medical progress simply involved the investigation of inorganic Nature, the general public would be only learners, gladly receiving such information in geology, chemistry, astronomy, or physics, as specialists in those branches of physical science were good enough to impart to the unlearned.\n\nBut directly scientific research passes beyond the distinctive realm of matter, moulded and transformed by general energy, but not affected by individual will, it has to deal with a very different principle, viz., life. This vital distinction has been well laid down by one of our eminent medical authorities as follows: 'During the slow growth of medical knowledge it has become more and more plain that physics, chemistry, and biology are distinct sciences, with methods of their own and inductions of their own; each of the latter terms in the series using the results of its predecessors, and adding new results of its own. Although life is a structure built up of physical and chemical facts, yet to the building, to the arrangement, to the ordering of those facts, there goes something that neither physics nor chemistry can explain, any more than algebra can explain the behaviour of a magnet. To strive to interpret the series of events which make up the life of an animal in terms of chemical change (metabolism), or of conservation or expenditure of energy, is an endeavour which will fail.'\n\nAs the brute creation, as well as human beings, share in a physical organization which expresses each variety of life, there is not the same sharply-dividing line between the various categories of animal life as there is between organic and inorganic Nature. Biogenesis, or life generated by life, is the distinctive feature of organic Nature. We are linked to living creatures of higher or lower nature by the power of educating or subduing them, and by all those varying relations involved in the mystery of life."
