"I have put into thy hands what has been the diversion of some of my idle and heavy hours. If it has the good luck to prove so of any of thine, and thou hast but half so much pleasure in reading as I had in writing it, thou wilt as little think thy money, as I do my pains, ill bestowed. Mistake not this for a commendation of my work ; nor conclude, because I was pleased with the doing of it, that therefore I am fondly taken with it now it is done. He that hawks at larks and sparrows has no less sport, though a much less considerable quarry, than he that flies at nobler game : and he is little acquainted with the subject of this treatise – the Understanding – who does not know that, as it is the most elevated faculty of the soul, so it is employed with a greater and more constant delight than any of the other. Its searches after truth are a sort of hawking and hunting, wherein the very pursuit makes a great part of the pleasure. Every step the mind takes in its progress towards Knowledge makes some discovery, which is not only new, but the best too, for the time at least.\n\nFor the understanding, like the eye, judging of objects only by its own sight, cannot but be pleased with what it discovers, having less regret for what has escaped it, because it is unknown. Thus he who has raised himself above the alms-basket, and, not content to live lazily on scraps of begged opinions, sets his own thoughts on work, to find and follow truth, will (whatever he lights on) not miss the hunter’s satisfaction ; every moment of his pursuit will reward his pains with some delight ; and he will have reason to think his time not ill spent, even when he cannot much boast of any great acquisition.\n\nThis, Reader, is the entertainment of those who let loose their own thoughts, and follow them in writing ; which thou oughtest not to envy them, since they afford thee an opportunity of the like diversion, if thou wilt make use of thy own thoughts in reading. It is to them, if they are thy own, that I refer myself : but if they are taken upon trust from others, it is no great matter what they are ; they are not following truth, but some meaner consideration ; and it is not worth while to be concerned what he says or thinks, who says or thinks only as he is directed by another. If thou judgest for thyself I know thou wilt judge candidly, and then I shall not be harmed or offended, whatever be thy censure. For though it be certain that there is nothing in this Treatise of the truth whereof I am not fully persuaded, yet I consider myself as liable to mistakes as I can think thee, and know that this book must stand or fall with thee, not by any opinion I have of it, but thy own. If thou findest little in it new or instructive to thee, thou art not to blame me for it. It was not meant for those that had already mastered this subject, and made a thorough acquaintance with their own understandings ; but for my own information, and the satisfaction of a few friends, who acknowledged themselves not to have sufficiently considered it.\n\nWere it fit to trouble thee with the history of this Essay, I should tell thee, that five or six friends meeting at my chamber, and discoursing on a subject very remote from this, found themselves quickly at a stand, by the difficulties that rose on every side. After we had awhile puzzled ourselves, without coming any nearer a resolution of those doubts which perplexed us, it came into my thoughts that we took a wrong course ; and that before we set ourselves upon inquiries of that nature, it was necessary to examine our own abilities, and see what objects our understandings were, or were not, fitted to deal with. This I proposed to the company, who all readily assented ; and thereupon it was agreed that this should be our first inquiry. Some hasty and undigested thoughts, on a subject I had never before considered, which I set down against our next meeting, gave the first entrance into this Discourse ; which having been thus begun by chance, was continued by intreaty ; written by incoherent parcels ; and after long intervals of neglect, resumed again, as my humour or occasions permitted ; and at last, in a retirement where an attendance on my health gave me leisure, it was brought into that order thou now seest it.\n\nThis discontinued way of writing may have occasioned, besides others, two contrary faults, viz., that too little and too much may be said in it. If thou findest anything wanting, I shall be glad that what I have written gives thee any desire that I should have gone further. If it seems too much to thee, thou must blame the subject ; for when I put pen to paper, I thought all I should have to say on this matter would have been contained in one sheet of paper ; but the further I went the larger prospect I had ; new discoveries led me still on, and so it grew insensibly to the bulk it now appears in. I will not deny, but possibly it might be reduced to a narrower compass than it is, and that some parts of it might be contracted, the way it has been writ in, by catches, and many long intervals of interruption, being apt to cause some repetitions. But to confess the truth, I am now too lazy, or too busy, to make it shorter."
