"Perhaps no Man ever had a more judicious or more methodical Genius, or was a more acute Logician than Mr. Locke, and yet he was not deeply skill'd in the Mathematicks. This great Man could never subject himself to the tedious Fatigue of Calculations, nor to the dry Pursuit of Mathematical Truths, which do not at first present any sensible Objects to the Mind; and no one has given better Proofs than he, that 'tis possible for a Man to have a geometrical Head without the Assistance of Geometry. Before his Time, several great Philosophers had declar'd, in the most positive Terms, what the Soul of Man is; but as these absolutely knew nothing about it, they might very well be allow'd to differ entirely in opinion from one another.\n\nIn Greece, the infant Seat of Arts and of Errors, and where the Grandeur as well as Folly of the human Mind went such prodigious Lengths, the People us'd to reason about the Soul in the very same Manner as we do.\n\nThe divine Anaxagoras, in whose Honour an Altar was erected, for his having taught Mankind that the Sun was greater than Peloponnesus, that Snow was black, and that the Heavens were of Stone; affirm'd that the Soul was an aerial Spirit, but at the sme Time immortal. Diogenes, (not he who was a cynical Philosopher after having coyn'd base Money) declar'd that the Soul was a Portion of the Substance of God; an Idea which we must confess was very sublime. Epicurus maintain'd that it was compos'd of Parts in the same Manner as the Body.\n\nAristotle who has been explain'd a thousand Ways, because he is unintelligible, was of Opinion, according to some of his Disciples, that the Understanding in all Men is one and the sane Substance.\n\nThe divine Plato, Master of the divine Aristotle, and the divine Socrates Master of the divine Plato, us'd to say that the Soul was corporeal and eternal. No doubt but the Demon of Socrates had instructed him in the Nature of it. Some People, indeed, pretend, that a Man who boasted his being attended by a familiar Genius must infallibly be either a Knave or a Madman, but this kind of People are seldom satisfied with any Thing but Reason.\n\nWith regard to the Fathers of the Church, several in the primitive Ages believ'd that the Soul was human, and the Angels and God corporeal. Men naturally improve upon every System. St. Bernard, as Father Mabillon confesses, taught that the Soul after Death does not see God in the celestial Regions, but converses with Christ's human nature only. However, he was not believ'd this Time on his bare Word; the Adventure of the Crusade having a little sunk the Credit of his Oracles. Afterwards a thousand Schoolmen arose, such as the irrefragable Doctor; the subtil Doctor, the angelic Doctor, the seraphic Doctor, and the cherubic Doctor, who were all sure that they had a very clear and distinst Idea of the Soul, and yet wrote in such a Manner, that one would conclude they were refolv'd no one should understand a Word in their Writings. Our Des Cartes, born to discover the Errors of Antiquity, and at the same Time to substitute his own; and hurried away by that systematic Spirit which throws a Cloud over the Minds of the greatest Men, thought he had demonstrated that the Soul is the same Thing as Thought, in the same Manner as Matter, in his Opinion, is the same as Extension. He asserted, that Man thinks eternally, and that the Soul, at its coming into the Body, is inform'd with the whole Series of metaphysical Notions; knowing God, infinite Space, possessing all abstract Ideas; in a Word, completely endued with the most sublime Lights, which it unhappily forgets at its issuing from the Womb.\n\nFather Malbranche, in his sublime Illusions, not only admitted innate Ideas, but did not doubt of our living wholly in God, and that God is, as it were, our Soul.\n\nSuch a Multitude of Reasoners having written the Romance of the Soul, a Sage at last arose, who gave, with an Air of the greatest Modesty, the History of it. Mr. Locke has display'd the human Soul, in the same Manner as an excellent Anatomist explains the Springs of the human Body. He every where takes the Light of Physicks for his Guide. He sometimes presumes to speak affirmatively, but then he presumes also to doubt. Instead of concluding at once what we know not, he examines gradually what we wou'd know. He takes an Infant at the Insant of his Birth; he traces, Step by Step, the Progress of his Understanding; examines what Things he has in common with Beasts, and what he possesses above them. Above all he consults himself; the being conscious that he himself thinks.\n\nI shall leave, says he, to those who know more of this Matter than my self, the examining whether the Soul exists before or after the Organization of our Bodies. But I confess that 'tis my Lot to be animated with one of those heavy Souls which do not think always; and I am even so unhappy as not to conceive, that 'tis more necessary the Soul should think perpetually, than that Bodies shou'd be for ever in Motion.\n\nWith regard to my self, I shall boast that I have the Honour to be as stupid in this Particular as Mr. Locke. No one shall ever make me believe, that I think always; and I am as little inclin'd as he cou'd be, to fancy that some Weeks after I was conceiv'd, I was a very learned Soul; knowing at that Time a thousand Things which I forgot at my Birth; and possessing when in the Womb, (tho' to no Manner of Purpose,) Knowledge which I lost the Instant I had occasion for it; and which I have never since been able to recover perfectly."
